 ![png](ERD.png)

In [6]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"

In [7]:
engine = create_engine(connection)

In [8]:
create_database(connection)

In [9]:
database_exists(connection)

True

In [47]:
import pandas as pd
df_users = pd.read_csv('users.csv', index_col=False)
df_users.set_index('id', inplace=True)
df_books = pd.read_csv('books.csv', index_col=False)
df_books.set_index('id', inplace=True)
df_authors = pd.read_csv('authors.csv', index_col=False)
df_authors.set_index('id', inplace=True)
df_favs = pd.read_csv('favorites.csv', index_col=False)

In [ ]:
#I obtained the set_index code from https://www.sharpsightlabs.com/blog/pandas-set-index/#:~:text=The%20syntax%20for%20the%20set_index%20method%20is%20fairly,you%20want%20to%20use%20as%20the%20new%20index.

In [48]:
df_users.head()

   first_name  last_name                 email
id
1        John        Doe          JD@books.com
2       Robin      Smith       Robin@books.com
3      Gloria  Rodriguez  grodriquez@books.com

In [49]:
df_books.head()

                   title  author_id
id
1            The Shining          1
2                     It          1
3       The Great Gatsby          2
4   The Call of the Wild          3
5    Pride and Prejudice          4

In [50]:
df_authors.head()

          author_name
id
1        Stephen King
2   F.Scott Fitgerald
3         Jack London
4         Jane Austen
5        Mary Shelley

In [51]:
df_favs.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [58]:
df_users.to_sql('user', engine, if_exists = 'replace')

3

In [53]:
df_books.to_sql('books', engine, if_exists = 'replace')

6

In [54]:
df_authors.to_sql('author', engine, if_exists = 'replace')

5

In [55]:
df_favs.to_sql('user_has_books', engine, if_exists = 'replace')

7

In [56]:
q = """SELECT * FROM user LIMIT 5;"""
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [59]:
q = """SELECT * FROM books LIMIT 5;"""
pd.read_sql(q, engine)

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [60]:
q = """SELECT * FROM author LIMIT 5;"""
pd.read_sql(q, engine)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [61]:
q = """SELECT * FROM user_has_books LIMIT 5;"""
pd.read_sql(q, engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5

In [66]:
q = '''SELECT books.title, user_has_books.user_id
FROM books
JOIN user_has_books ON books.id = user_has_books.book_id
WHERE user_has_books.user_id = 
    (SELECT user.id FROM user WHERE (user.last_name = "Doe" AND user.first_name = "John"));'''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1